examples/PilotDC-H2/constant/boundaryRadiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2312                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    location "constant";
    object   boundaryRadiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

cathode
{
    type lookup;
    emissivity 0.7;
    absorptivity 0.7;
}
anode
{
    type lookup;
    emissivity 0.7;
    absorptivity 0.7;
}
electrodewalls
{
    type lookup;
    emissivity 0.7;
    absorptivity 0.7;
}
top
{
    type lookup;
    emissivity 1;
    absorptivity 1;
}
sides
{
    type lookup;
    emissivity 0.7;
    absorptivity 0.7;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
