examples/PilotDC-H2/constant/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiation on;

radiationModel P1;

solverFreq 1;

absorptionEmissionModel greyPlasmaAbsorptionEmission;
plasmaRadiationData
{
    #include "dataH2/dataAbsorptionCoeffs.foam";
    #include "dataH2/dataEmissionCoeffs.foam";
}

scatterModel none;
sootModel none;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
