examples/PilotDC-H2/system/surfaceFeatureExtractDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Web:      www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    location "system";
    object   surfaceFeatureExtractDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

modeldomain.stl
{
    extractionMethod extractFromSurface;
    includedAngle 135;
    geometricTestOnly no;
    intersectionMethod none;
    writeObj no;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
